In [2]:
import numpy as np
import pandas as pd

In [8]:
pd_series = pd.Series([10, 20, 30, 40, 50])
print(pd_series.index)
print(pd_series.dtype)

RangeIndex(start=0, stop=5, step=1)
int64

In [10]:
data = [
    {"name":"Horidas", "age": 25, "city":"Lalmonirhat"},
    {"name":"Milon", "age": 23, "city":"Rangpur"},
    {"name":"Goto Chandh", "age": 22, "city":"Dinajpur"},
    {"name":"Hori", "age": 27, "city":"Dhaka"}
]
df = pd.DataFrame(data)
df

          name  age         city
0      Horidas   25  Lalmonirhat
1        Milon   23      Rangpur
2  Goto Chandh   22     Dinajpur
3         Hori   27        Dhaka

In [17]:
data = [
    ["Horidas", 25, "Lalmonirhat"],
    ["Milon", 23, "Rangpur"],
    ["Goto Chandh", 22, "Dinajpur"],
    ["Hori", 27, "Dhaka"]
]
df = pd.DataFrame(data,columns=["name",'age','city'])
df

          name  age         city
0      Horidas   25  Lalmonirhat
1        Milon   23      Rangpur
2  Goto Chandh   22     Dinajpur
3         Hori   27        Dhaka

In [19]:
df.shape

(4, 3)

In [27]:
df['age'].dtype

dtype('int64')

In [29]:
df.describe()

             age
count   4.000000
mean   24.250000
std     2.217356
min    22.000000
25%    22.750000
50%    24.000000
75%    25.500000
max    27.000000

In [30]:
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

df = pd.DataFrame(data)
df

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
df["Product"]

0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

In [35]:
df.iloc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [36]:
df.set_index("Product")

         Price  Quantity
Product
Pen         10       100
Book        50        60
Eraser       5       200
Pencil       7       150

In [38]:
df.loc[0:2]

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200

In [43]:
df.iloc[0:2, 0:2]

  Product  Price
0     Pen     10
1    Book     50

In [44]:
student = {
    'name': ["akash","batash","patal","katal"],
    'age': [70, 76, 89, 83]
}

In [46]:
student_data = pd.DataFrame(student)
student_data

     name  age
0   akash   70
1  batash   76
2   patal   89
3   katal   83

In [50]:
# student_data.drop('name', axis=1)
student_data.drop(2, axis=0)

     name  age
0   akash   70
1  batash   76
3   katal   83

In [51]:
employe = {
    'name':["Horidas","Milon","Gouto Chandh","Habib","Tasnimul"],
    'department':['It','sales','marketing','data Science','security'],
    'salary':[25000,20000,18000,27000,15000]
}

In [60]:
employe_data = pd.DataFrame(employe)
employe_data

           name    department  salary
0       Horidas            It   25000
1         Milon         sales   20000
2  Gouto Chandh     marketing   18000
3         Habib  data Science   27000
4      Tasnimul      security   15000

In [67]:
employe_data.sort_values(['salary'])

           name    department  salary
4      Tasnimul      security   15000
2  Gouto Chandh     marketing   18000
1         Milon         sales   20000
0       Horidas            It   25000
3         Habib  data Science   27000

In [68]:
employe_data.sort_values('name',ascending=False)

           name    department  salary
4      Tasnimul      security   15000
1         Milon         sales   20000
0       Horidas            It   25000
3         Habib  data Science   27000
2  Gouto Chandh     marketing   18000

In [69]:
employe_data.sort_values(['salary', 'name'], ascending = [True, False])

           name    department  salary
4      Tasnimul      security   15000
2  Gouto Chandh     marketing   18000
1         Milon         sales   20000
0       Horidas            It   25000
3         Habib  data Science   27000

In [70]:
student = {
    'name':["a",'b','c','d','e','f','g','h'],
    'score':[87,29,30,87,90,43,87,13]
}

In [79]:
data = pd.DataFrame(student)
filter_data = data[(data['score'] > 60) & (data['score'] < 40)]
filter_data

Empty DataFrame
Columns: [name, score]
Index: []